Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When either ID or access token must be decrypted, `quarkus.oidc.token.decryption-key-location` is checked first. If this property is not configured, then the <<jwt-client-credentials>> key, if available, is used. Finally, if the decryption key is still not initialized, the configured client secret is used as a decryption key.
ja_jp: ID トークンまたはアクセストークンの復号化が必要な場合、まず `quarkus.oidc.token.decryption-key-location` がチェックされます。このプロパティーが設定されていない場合は、利用可能であれば <<jwt-client-credentials>> キーが使用されます。最後に、復号キーがまだ初期化されていない場合は、設定されたクライアントシークレットが復号キーとして使用されます。

source: When either `/frontend/user-name-with-oidc-client-token` or `/frontend/admin-name-with-oidc-client-token` endpoint is called, `FrontendResource` uses a REST client with an OIDC client filter to get and propagate an access token to `ProtectedResource` . When either `/frontend/user-name-with-oidc-client-token-header-param` or `/frontend/admin-name-with-oidc-client-token-header-param` endpoint is called, `FrontendResource` uses a programmatically created OIDC client to get and propagate an access token to `ProtectedResource` by passing it to a REST client method as an HTTP `Authorization` header value. When either `/frontend/user-name-with-propagated-token` or `/frontend/admin-name-with-propagated-token` endpoint is called, `FrontendResource` uses a REST client with `OIDC Token Propagation Filter` to propagate the current incoming access token to `ProtectedResource`.
ja_jp: `/frontend/user-name-with-oidc-client-token` または `/frontend/admin-name-with-oidc-client-token` エンドポイントのいずれかが呼び出されると、 `FrontendResource` は OIDC クライアントフィルターを備えた REST クライアントを使用してアクセストークンを取得し、 `ProtectedResource` に伝播します。 `/frontend/user-name-with-oidc-client-token-header-param` または `/frontend/admin-name-with-oidc-client-token-header-param` エンドポイントのいずれかが呼び出されると、 `FrontendResource` はプログラムで作成された OIDC クライアントを使用してアクセストークンを取得し、それを HTTP `Authorization` ヘッダー値として REST クライアントメソッドに渡すことで `ProtectedResource` に伝播します。 `/frontend/user-name-with-propagated-token` または `/frontend/admin-name-with-propagated-token` エンドポイントのいずれかが呼び出されると、 `FrontendResource` は `OIDC Token Propagation Filter` を備えた REST クライアントを使用して、現在の受信アクセストークンを `ProtectedResource` に伝播します。

source: When enabled, Quarkus adds OpenTelemetry End User attributes as Span attributes. Before you enable this feature, verify that Quarkus Security extension is present and configured. More information about the Quarkus Security can be found in the xref:security-overview.adoc[Quarkus Security overview].
ja_jp: 有効にすると、Quarkus は OpenTelemetry エンドユーザー属性を Span 属性として追加します。 この機能を有効にする前に、Quarkus Security エクステンションが存在し、設定されていることを確認してください。 Quarkus Security の詳細は、xref:security-overview.adoc[Quarkus Security の概要] を参照してください。

source: When enabled, {project-name} generates `StdSerializer` and `StdDeserializer` implementations at build time for each class requiring JSON conversion. The application then processes objects returned by REST endpoints using these generated serializers and deserializers, eliminating reliance on reflection and improving performance.
ja_jp: 有効にすると、{project-name} は、JSON 変換を必要とする各クラスのビルド時に `StdSerializer` と `StdDeserializer` の実装を生成します。 アプリケーションはこれらの生成されたシリアライザーとデシリアライザーを使用してRESTエンドポイントから返されたオブジェクトを処理します。

source: When enabling <<database-approach,database multi-tenancy>>, Hibernate ORM will use multiple datasources at runtime for the same persistence unit, and by default Quarkus cannot tell which datasource is going to be used, so it will not be able to detect a dialect to use in Hibernate ORM.
ja_jp: <<database-approach,database multi-tenancy>> を有効にすると、 Hibernate ORM は実行時に同じ永続化ユニットに対して複数のデータソースを使用します。 デフォルトでは Quarkus はどのデータソースが使用されるかを判断できません。 そのため、Hibernate ORM で使用するダイアレクトを検出できなくなります。

source: When enabling AOT via `quarkus.package.jar.aot.enabled=true`, Quarkus will automatically switch to the `aot-jar` JAR packaging if none is explicitly configured via `quarkus.package.jar.type`.
ja_jp: `quarkus.package.jar.aot.enabled=true` で AOT を有効にすると、 `quarkus.package.jar.type` で明示的に設定されていない限り、Quarkus は自動的に `aot-jar` JAR パッケージングに切り替わります。

source: When evaluating expressions a list of registered <<value-resolvers,value resolvers>> is used. The first part of the expression is always resolved against the <<current_context_object,current context object>>. If no result is found for the first part, it's resolved against the parent context object (if available). For an expression that starts with a namespace the current context object is found using all the available ``NamespaceResolver``s. For an expression that does not start with a namespace the current context object is *derived from the position* of the tag. All other parts of an expression are resolved using all ``ValueResolver``s against the result of the previous resolution.
ja_jp: 式を評価する場合、登録された<<value-resolvers,value resolvers>> リストを使用します。 式の最初のパーツは、常に <<current_context_object,current context object>> に対して解決されます。 最初のパーツの結果が見つからない場合、(利用可能な場合は) 親コンテキストオブジェクトに対して解決されます。 名前空間で始まる式の場合、現在のコンテキストオブジェクトは、利用可能なすべての ``NamespaceResolver`` を使用して検出されます。 名前空間で始まらない式の場合、現在のコンテキストオブジェクトはタグの *位置から導出* されます。 式の他のすべてのパーツは、前の解決結果に対してすべての ``ValueResolver`` を使用して解決されます。

source: When executed in a duplicated context, the code can store data without sharing it with the other concurrent processing. So, you can store, retrieve and remove local data. The continuation invokes on the same duplicated context, will have access to that data:
ja_jp: 複製コンテキストで実行された場合、コードは他の並行処理と共有することなくデータを保存できます。 そのため、ローカルデータの保存、取得、削除を行うことができます。同じ複製コンテキストで実行された継続処理は、そのデータにアクセスすることができます：

source: When executing an HTTP GET request against `http://localhost:8080/hello`, you see a JSON message with the value `hello` as its `message` field.
ja_jp: `http://localhost:8080/hello` に対してHTTP GETリクエストを実行すると、 `message` フィールドに `hello` という値を持つJSONメッセージが表示されます。

source: When executing batch queries, reactive SQL clients return a `RowSet` that corresponds to the results of the first element in the batch. To get the results of the following batch elements, you must invoke the `RowSet#next` method until it returns `null`.
ja_jp: バッチクエリーを実行すると、リアクティブ SQL クライアントはバッチの最初の要素の結果に対応する `RowSet` を返します。次のバッチ要素の結果を取得するには、 `null` が返されるまで `RowSet#next` メソッドを呼び出す必要があります。

source: When extending a `QwcHotReloadElement`, you have to use the `hotReload` method. (You must also still provide the `render` method from Lit)
ja_jp: `QwcHotReloadElement` を拡張する場合は、 `hotReload` メソッドを使用する必要があります (Lit の `render` メソッドも提供する必要があります)。

source: When following redirects automatically is disabled, and Quarkus OIDC HTTP client receives a redirect request, it will attempt to recover only once by following the redirect URI, but only if it is exactly the same as the original request URI, and as long as one or more cookies were set during the redirect request.
ja_jp: リダイレクトへの自動対応が無効になっている場合、Quarkus OIDC HTTP クライアントはリダイレクトリクエストを受信すると、リダイレクト URI が元のリクエスト URI とまったく同じで、リダイレクトリクエスト中に 1 つ以上の Cookie が設定されている場合に限り、リダイレクト URI に従って 1 回だけ回復を試みます。

source: When following redirects automatically is disabled, and the Quarkus OIDC HTTP client receives a redirect request, it will attempt to recover only once by following the redirect URI, but only if it is exactly the same as the original request URI, and as long as one or more cookies were set during the redirect request.
ja_jp: リダイレクトへの自動対応が無効になっている場合、Quarkus OIDC HTTP クライアントはリダイレクトリクエストを受信すると、リダイレクト URI が元のリクエスト URI とまったく同じで、リダイレクトリクエスト中に 1 つ以上の Cookie が設定されている場合に限り、リダイレクト URI に従って 1 回だけ回復を試みます。

source: When gRPC classes - the classes generated from `proto` files - are in a dependency of the application, then the dependency needs a Jandex index. The `jandex-maven-plugin` can be used to create a Jandex index. More information on this topic can be found in the xref:cdi-reference.adoc#bean_discovery[Bean Discovery] section of the CDI guide.
ja_jp: gRPCクラス（ `proto` ファイルから生成されたクラス）がアプリケーションの依存関係にある場合、その依存関係にはJandexインデックスが必要です。 `jandex-maven-plugin` は、Jandexインデックスを作成するために使用できます。このトピックの詳細については、CDIガイドのxref:cdi-reference.adoc#bean_discovery[Bean Discovery]セクションを参照してください。

source: When gRPC classes, which are classes generated from `proto` files, are in a dependency of the application, the dependency needs a Jandex index. You can create a Jandex index using the `jandex-maven-plugin`. More information on this topic can be found in the xref:cdi-reference.adoc#bean_discovery[Bean Discovery] section of the CDI guide.
ja_jp: `proto` ファイルから生成されたクラスである gRPC クラスがアプリケーションの依存関係にある場合、依存関係には Jandex インデックスが必要です。 `jandex-maven-plugin` を使用して Jandex インデックスを作成できます。 このトピックの詳細は、CDI ガイドの xref:cdi-reference.adoc#bean_discovery[Bean の検出] セクションを参照してください。

source: When generating native executables, you must also mark `jnr.ffi.provider.jffi.NativeFinalizer$SingletonHolder` as runtime initialized.
ja_jp: ネイティブ実行可能ファイルを生成する際には、 `jnr.ffi.provider.jffi.NativeFinalizer$SingletonHolder` を実行時初期化済としてマークする必要があります。

source: When generating native executables, you must mark `jnr.ffi.provider.jffi.NativeFinalizer$SingletonHolder` as runtime initialized.
ja_jp: ネイティブ実行可能ファイルを生成する場合は、 `jnr.ffi.provider.jffi.NativeFinalizer$SingletonHolder` をランタイム初期化済としてマークする必要があります。

source: When generating the Kubernetes manifests, Quarkus automatically adds some labels and annotations to give extra information about the generation date or versions. For example:
ja_jp: Kubernetesマニフェストを生成する際、Quarkusは自動的にいくつかのラベルとアノテーションを追加し、生成日やバージョンに関する追加情報を提供します。例えば、以下のようなものです:

source: When generating the manifests for multiple deployment targets like Kubernetes, OpenShift or Knative, we can place the common resources in `src/main/kubernetes/common.yml`, so these resources will be integrated into the generated `kubernetes.json`/`kubernetes.yml`, and `openshift.json`/`openshift.yml` files (if you configure the Kubernetes and OpenShift extensions at the same time).
ja_jp: Kubernetes、OpenShift、Knative など複数のデプロイメントターゲット用のマニフェストを生成する場合、共通リソースを `src/main/kubernetes/common.yml` に配置することで、これらのリソースは生成された `kubernetes.json`/`kubernetes.yml` ファイルおよび `openshift.json`/`openshift.yml` ファイルに統合されます (Kubernetes および OpenShift エクステンションを同時に設定した場合）。

source: When generating the manifests for multiple deployment targets like Kubernetes, OpenShift or Knative, we can place the common resources in `src/main/kubernetes/common.yml`, so these resources will be integrated into the generated `kubernetes.json`/`kubernetes.yml`, and `openshift.json`/`openshift.yml` files (if you configure the Kubernetes and Openshift extensions at the same time).
ja_jp: Kubernetes、OpenShift、Knativeなど複数のデプロイメントターゲット用のマニフェストを生成する場合、共通リソースを `src/main/kubernetes/common.yml` に配置することで、これらのリソースは生成された `kubernetes.json `/ `kubernetes.yml` 、および `openshift.json `/ `openshift.yml` ファイルに統合されます（KubernetesおよびOpenShiftエクステンションを同時に設定した場合）。

source: When handling a `@POST`, `@PUT` or `@DELETE` endpoint, it is common practice to redirect to a `@GET` endpoint after the action has been performed to allow the user to reload the page without triggering the action a second time. There are multiple ways to achieve this.
ja_jp: `@POST` 、 `@PUT` 、 `@DELETE` のエンドポイントを処理する場合、アクションの実行後に `@GET` のエンドポイントにリダイレクトするのが一般的で、ユーザーが2回目のアクションをトリガーせずにページを再読み込みできるようにします。これを実現するには、複数の方法があります。

source: When handling file uploads, it is very important to move the file to permanent storage (like a database, a dedicated file system or a cloud storage) in your code that handles the POJO. Otherwise, the file will no longer be accessible when the request terminates. Moreoever if `quarkus.http.body.delete-uploaded-files-on-end` is set to true, Quarkus will delete the uploaded file when the HTTP response is sent. If the setting is disabled, the file will reside on the file system of the server (in the directory defined by the `quarkus.http.body.uploads-directory` configuration option), but as the uploaded files are saved with a UUID file name and no additional metadata is saved, these files are essentially a random dump of files.
ja_jp: ファイルのアップロードを処理する場合、POJO を処理するコード内でファイルを永続的なストレージ (データベース、専用ファイルシステム、クラウドストレージなど) に移動させることが非常に重要です。そうしないと、リクエストが終了したときに、ファイルにアクセスできなくなります。さらに、 `quarkus.http.body.delete-uploaded-files-on-end` を true に設定すると、HTTP レスポンスの送信時に、アップロードされたファイルが削除されます。この設定を無効にすると、ファイルはサーバーのファイルシステム上 (`quarkus.http.body.uploads-directory` 設定オプションで定義したディレクトリー) に存在しますが、アップロードされたファイルは UUID ファイル名で保存されて追加のメタデータが保存されないため、これらのファイルは本質的にファイルのランダムダンプとなります。

source: When handling file uploads, it is very important to move the file to permanent storage (like a database, a dedicated file system or a cloud storage) in your code that handles the POJO. Otherwise, the file will no longer be accessible when the request terminates. Moreover, if `quarkus.http.body.delete-uploaded-files-on-end` is set to true, Quarkus will delete the uploaded file when the HTTP response is sent. If the setting is disabled, the file will reside on the file system of the server (in the directory defined by the `quarkus.http.body.uploads-directory` configuration option), but as the uploaded files are saved with a UUID file name and no additional metadata is saved, these files are essentially a random dump of files.
ja_jp: ファイルのアップロードを処理する場合、POJO を処理するコード内でファイルを永続的なストレージ (データベース、専用ファイルシステム、クラウドストレージなど) に移動させることが非常に重要です。そうしないと、リクエストが終了したときに、ファイルにアクセスできなくなります。さらに、 `quarkus.http.body.delete-uploaded-files-on-end` を true に設定すると、HTTP レスポンスの送信時に、アップロードされたファイルが削除されます。この設定を無効にすると、ファイルはサーバーのファイルシステム上 (`quarkus.http.body.uploads-directory` 設定オプションで定義したディレクトリー) に存在しますが、アップロードされたファイルは UUID ファイル名で保存されて追加のメタデータが保存されないため、これらのファイルは本質的にファイルのランダムダンプとなります。

source: When having multiple schemas in Oracle, you can use the `quarkus.flyway.schemas` property to specify the schemas that Flyway should manage. However, because this is executed in the DB as the `quarkus` user, you need to either give DBA privileges to the user that is executing the migration (`quarkus`) or perform the necessary DDLs before the Dev Service starts. This is done with the `quarkus.datasource.devservices.init-privileged-script-path` configuration.
ja_jp: Oracle に複数のスキーマがある場合、Flyway が管理すべきスキーマを指定するために `quarkus.flyway.schemas` プロパティーを使用できます。ただし、これは DB で `quarkus` ユーザーとして実行されるため、マイグレーションを実行するユーザー (`quarkus`) に DBA 権限を付与するか、Dev Service の開始前に必要な DDL を実行する必要があります。これは `quarkus.datasource.devservices.init-privileged-script-path` 設定で行います。

source: When health checks are available, you can access the `/health/ready` endpoint of your application and have information about the connection validation status.
ja_jp: ヘルスチェックが利用可能になると、アプリケーションの `/health/ready` エンドポイントにアクセスして、接続検証ステータスに関する情報を取得できます。

source: When importing a `import.sql` to set up your database, keep in mind that Quarkus reconfigures Hibernate ORM so to require a semicolon (`;`) to terminate each statement. The default in Hibernate is to have a statement per line, without requiring a terminator other than newline: remember to convert your scripts to use the `;` terminator character if you're reusing existing scripts. This is useful so to allow multi-line statements and human friendly formatting.
ja_jp: データベースをセットアップするために `import.sql` をインポートする際、QuarkusはHibernate ORMを再構成し、各ステートメントの最後にセミコロン（ ';' ）を必要とすることに留意してください。Hibernateのデフォルトでは、改行以外の終端文字を必要とせず、1行に1つのステートメントがあります。既存のスクリプトを再利用する場合は、終端文字として「;」を使用するようにスクリプトを変換することを忘れないでください。これは、複数行のステートメントを可能にし、人間が使いやすいフォーマットにするために役立ちます。

source: When importing a `import.sql` to setup your database, keep in mind that Quarkus reconfigures Hibernate ORM so to require a semicolon (';') to terminate each statement. The default in Hibernate is to have a statement per line, without requiring a terminator other than newline: remember to convert your scripts to use the ';' terminator character if you're reusing existing scripts. This is useful so to allow multi-line statements and human friendly formatting.
ja_jp: `import.sql` をインポートしてデータベースをセットアップする場合、Quarkus では Hibernate ORM を再設定して、各ステートメントの終端にセミコロン (';') が必要になることに注意してください。 Hibernateのデフォルトでは、改行以外の終端文字を必要とせず、1行ごとにステートメントがあります。既存のスクリプトを再利用する場合は、終端文字として';'を使用するようにスクリプトを変換することを忘れないでください。 これは、複数行のステートメントや人間にとって使いやすい書式設定を可能にするために便利です。

source: When initializing a constraint validator of a given type, Quarkus will check if a bean of this type is available and, if so, it will use it instead of instantiating a `ConstraintValidator`.
ja_jp: 指定された型の制約バリデーターを初期化する際、Quarkusはこの型のBeanが利用可能かどうかをチェックし、利用可能な場合は `ConstraintValidator` のインスタンスを作成する代わりにそれを使用します。

source: When initializing a constraint validator of a given type, Quarkus will check if a bean of this type is available and, if so, it will use it instead of instantiating one.
ja_jp: 指定された型の制約バリデータを初期化する際、Quarkusはこの型のBeanが利用可能かどうかをチェックし、利用可能な場合はインスタンスを作成する代わりにそれを使用します。

source: When injecting beans relying on the runtime configuration, use `@Inject Instance<..>`. Since constraints are initialized at build time, it is not possible to completely preconfigure the constraint in the `initialize(..)` method, as the runtime information will be missing at that point. The `initialize(..)` method in such scenarios can still be used to read the constraint annotation parameters, and perform any work not relying on the runtime configuration. Hence, it is recommended that any heavy configuration work happens as part of the injected bean initialization and methods used in the `ConstraintValidator#isValid(..)` implementation are as fast as possible:
ja_jp: 実行時設定に依存するBeanを注入する場合、 `@Inject Instance<..>` を使用してください。 制約はビルド時に初期化されるので、 `initialize(..)` メソッドで制約を完全に事前設定することはできません。 このようなシナリオの `initialize(..)` メソッドは、制約注釈パラメータを読み取るために使用することができます。 したがって、注入されたBeanの初期化の一部として重い設定作業が行われ、 `ConstraintValidator#isValid(..)` 実装で使用されるメソッドが可能な限り高速であることが推奨されます：

source: When installing Podman Desktop on Mac or Windows, it's important to enable Docker compatibility mode when prompted. This will ensure the podman-mac-helper is setup on your behalf (normally a manual action you are prompted to do after start), necessary for supporting /var/run/docker.sock (privileged location). It will also install support for Docker Compose.
ja_jp: MacまたはWindowsにPodman Desktopをインストールする際、プロンプトが表示されたらDocker互換モードを有効にすることが重要です。これにより、/var/run/docker.sock（特権ロケーション）をサポートするために必要なPodman-Mac-helperがあなたの代わりにセットアップされます（通常は起動後に手動で行うよう促されます）。また、Docker Compose のサポートもインストールされます。

source: When installing the certificate, your system might ask for your password to install the certificate in the system truststore or ask for confirmation in a dialog on Windows.
ja_jp: 証明書をインストールするときに、システムのトラストストアに証明書をインストールするためのパスワードの入力を求められたり、Windows のダイアログで確認を求められたりすることがあります。

source: When installing the certificate, your system might prompt for your password to add it to the system truststore, or display a confirmation dialog on Windows.
ja_jp: 証明書をインストールするとき、システムがシステムトラストストアに追加するためのパスワードを要求したり、Windows で確認ダイアログを表示したりする場合があります。

source: When integrating with other extensions, notably using Emitters, it relies on the Mutiny context propagation:
ja_jp: 特に Emitter を使用して他のエクステンションと統合する場合、Mutiny のコンテキスト伝搬に依存します。

source: When interacting with Infinispan in Quarkus, you can easily serialize and deserialize Java primitive types when storing or retrieving data from the cache. No additional marshalling configuration is required for Infinispan.
ja_jp: Quarkus で Infinispan と対話する場合、キャッシュにデータを保存したり、キャッシュからデータを取得する際に、Java プリミティブ型を簡単にシリアル化およびデシリアル化できます。Infinispan には追加のマーシャリング設定は必要ありません。

source: When invoking the REST API on any of the three instances, it might either be that the aggregation for the requested weather station id is stored locally on the node receiving the query, or it could be stored on one of the other two nodes.
ja_jp: 3つのインスタンスのいずれかでREST APIを呼び出す場合、要求されたウェザーステーションIDの集約は、クエリを受信したノードにローカルに格納されるか、他の2つのノードのいずれかに格納されるかのどちらかであるかもしれません。

source: When invoking the callback methods, the _session_ scope linked to the WebSocket connection remains active. In addition, the request scope is active until the completion of the method (or until it produces its result for async and reactive methods).
ja_jp: コールバックメソッドを呼び出すと、WebSocket 接続にリンクされた _セッション_ スコープはアクティブなままになります。 さらに、リクエストスコープはメソッドが完了するまで (または非同期メソッドとリアクティブメソッドの場合は結果が生成されるまで) アクティブです。

source: When is re-augmentation useful?
ja_jp: どのような場合に再オーグメンテーションが有効ですか？

source: When it comes to writing Hibernate ORM entities, there are a number of annoying things that users have grown used to reluctantly deal with, such as:
ja_jp: Hibernate ORM エンティティーを書くことになると、ユーザーが不本意ながらも対処することに慣れてしまった、いくつかの厄介事があります。

source: When it comes to writing Hibernate Reactive entities, there are a number of annoying things that users have grown used to reluctantly deal with, such as:
ja_jp: HibernateのReactiveエンティティを書くときに、ユーザーが不本意ながらも対処することに慣れてしまった、いくつかの厄介事があります:

source: When it comes to writing MongoDB entities, there are a number of annoying things that users have grown used to reluctantly deal with, such as:
ja_jp: MongoDBのエンティティを書くときには、以下のように、ユーザーが不本意ながら慣れてしまっている厄介なことがたくさんあります。

source: When it’s done, the output will display the URL of your application (target URL), you can use it with curl or directly open it in your browser using `gcloud app browse`.
ja_jp: コマンド実行が完了すると、出力にはアプリケーションの URL (ターゲット URL) が表示されます。curlを使うか、 `gcloud app browse` を使ってブラウザで直接アプリケーションを開くことができます。

source: When it’s done, the output will display the URL of your application (target url), you can use it with curl or directly open it in your browser using `gcloud app browse`.
ja_jp: コマンド実行が完了すると、出力にはアプリケーションの URL (ターゲット URL) が表示されます。curlを使うか、 `gcloud app browse` を使ってブラウザで直接アプリケーションを開くことができます。

source: When living within a Knative Events environment, Funqy functions are triggered by a specific Cloud Event type. You can have multiple Funqy functions within a single application/deployment, but they must be triggered by a specific Cloud Event Type. The exception to this rule is if there is only one Funqy function in the application. In that case, the event is pushed to that function irregardless of the Cloud Event type.
ja_jp: Knative Events環境内で稼働する場合、Funqy関数は特定のタイプの Cloud Event によってトリガーされます。1つのアプリケーション/デプロイメント内に複数のFunqy関数を持つことができますが、それらは特定のタイプの Cloud Event によってトリガーされなければなりません。このルールの例外は、アプリケーション内にFunqy関数が1つしかない場合です。この場合、イベントは Cloud Event タイプに関係なく、その関数にプッシュされます。

source: When logging in the Keycloak admin console, the username is `admin` and the password is `admin`.
ja_jp: Keycloak 管理コンソールにログインする場合、ユーザー名は `admin`、パスワードは `admin` です。

source: When logging in to the Keycloak admin console, the username is `admin`, and the password is `admin`.
ja_jp: Keycloak 管理コンソールにログインする場合、ユーザー名は `admin`、パスワードは `admin` です。

source: When mapping an exception to a `@ServerExceptionMapper` method, the cause of the exception normally does not come into play.
ja_jp: 例外を `@ServerExceptionMapper` メソッドにマッピングする場合、例外の原因は通常は考慮されません。

source: When measuring performance of a framework like Quarkus the latency experience by users are especially interesting and for that there are many different tools. Unfortunately, many fail to measure the latency correctly and instead fall short and create the Coordinate Omission problem. Meaning tools fails to acoomodate for delays to submit new requests when system is under load and aggregate these numbers making the latency and throughput numbers very misleading.
ja_jp: Quarkusのようなフレームワークのパフォーマンスを測定する場合、ユーザーが経験するレイテンシーは特に注目の対象で、そのためにさまざまなツールがあります。残念なことに、多くのツールはレイテンシを正しく測定することができず、協調的省略問題を引き起こしています。つまり、ツールは、システムが負荷下にあるときに新しいリクエストを送信する遅延に適応することに失敗し、これらの数値を集計するため、待ち時間とスループットの数値が非常に誤解を招きやすくなります。
